## Устанавливаем необходимые библиотеки SQL для работы в JN

Устанавливаем MySQL https://dev.mysql.com/downloads/installer/

Устанавливаем необходимые библиотеки:

In [1]:
# !pip install pymysql  # не надо
# !pip install ipython-sql
# !pip install mysqlclient
# !pip install mysql-connector-python  # не надо
# !pip install sqlalchemy

Устанавливаем соединениес MySQL:

In [1]:
import sqlalchemy

In [2]:
sqlalchemy.create_engine("mysql://root:123qwe@localhost/mydb")

Engine(mysql://root:***@localhost/mydb)

In [3]:
%load_ext sql

In [4]:
%sql mysql://root:123qwe@localhost/mydb

### Проверяем базы данных «Интернет-магазин книг», либо обновляем с предыдущего урока

In [5]:
%%sql
SELECT * FROM author;

 * mysql://root:***@localhost/mydb
5 rows affected.

[(1, 'Булгаков М.А.'),
 (2, 'Достоевский Ф.М.'),
 (3, 'Есенин С.А.'),
 (4, 'Пастернак Б.Л.'),
 (5, 'Лермонтов М.Ю.')]

In [6]:
%%sql
SELECT * FROM genre;

 * mysql://root:***@localhost/mydb
3 rows affected.

[(1, 'Роман'), (2, 'Поэзия'), (3, 'Приключения')]

In [7]:
%%sql
SELECT * FROM book;

 * mysql://root:***@localhost/mydb
8 rows affected.

[(1, 'Мастер и Маргарита', 1, 1, Decimal('670.99'), 3),
 (2, 'Белая гвардия', 1, 1, Decimal('540.50'), 5),
 (3, 'Идиот', 2, 1, Decimal('460.00'), 10),
 (4, 'Братья Карамазовы', 2, 1, Decimal('799.01'), 2),
 (5, 'Игрок', 2, 1, Decimal('480.50'), 10),
 (6, 'Стихотворения и поэмы', 3, 2, Decimal('650.00'), 15),
 (7, 'Черный человек', 3, 2, Decimal('570.20'), 6),
 (8, 'Лирика', 4, 2, Decimal('518.99'), 2)]

In [8]:
%%sql
SELECT * FROM city;

 * mysql://root:***@localhost/mydb
3 rows affected.

[(1, 'Москва', 5), (2, 'Санкт-Петербург', 3), (3, 'Владивосток', 12)]

In [9]:
%%sql
SELECT * FROM client;

 * mysql://root:***@localhost/mydb
4 rows affected.

[(1, 'Баранов Павел', 3, 'baranov@test'),
 (2, 'Абрамова Катя', 1, 'abramova@test'),
 (3, 'Семенонов Иван', 2, 'semenov@test'),
 (4, 'Яковлева Галина', 1, 'yakovleva@test')]

In [10]:
%%sql
SELECT * FROM buy;

 * mysql://root:***@localhost/mydb
4 rows affected.

[(1, 'Доставка только вечером', 1),
 (2, None, 3),
 (3, 'Упаковать каждую книгу по отдельности', 2),
 (4, None, 1)]

In [11]:
%%sql
SELECT * FROM buy_book;

 * mysql://root:***@localhost/mydb
8 rows affected.

[(1, 1, 1, 1),
 (2, 1, 7, 2),
 (3, 1, 3, 1),
 (4, 2, 8, 2),
 (5, 3, 3, 2),
 (6, 3, 2, 1),
 (7, 3, 1, 1),
 (8, 4, 5, 1)]

In [12]:
%%sql
SELECT * FROM step;

 * mysql://root:***@localhost/mydb
4 rows affected.

[(1, 'Оплата'), (2, 'Упаковка'), (3, 'Транспортировка'), (4, 'Доставка')]

In [13]:
%%sql
SELECT * FROM buy_step;

 * mysql://root:***@localhost/mydb
16 rows affected.

[(1, 1, 1, datetime.date(2020, 2, 20), datetime.date(2020, 2, 20)),
 (2, 1, 2, datetime.date(2020, 2, 20), datetime.date(2020, 2, 21)),
 (3, 1, 3, datetime.date(2020, 2, 22), datetime.date(2020, 3, 7)),
 (4, 1, 4, datetime.date(2020, 3, 8), datetime.date(2020, 3, 8)),
 (5, 2, 1, datetime.date(2020, 2, 28), datetime.date(2020, 2, 28)),
 (6, 2, 2, datetime.date(2020, 2, 29), datetime.date(2020, 3, 1)),
 (7, 2, 3, datetime.date(2020, 3, 2), None),
 (8, 2, 4, None, None),
 (9, 3, 1, datetime.date(2020, 3, 5), datetime.date(2020, 3, 5)),
 (10, 3, 2, datetime.date(2020, 3, 5), datetime.date(2020, 3, 6)),
 (11, 3, 3, datetime.date(2020, 3, 6), datetime.date(2020, 3, 10)),
 (12, 3, 4, datetime.date(2020, 3, 11), None),
 (13, 4, 1, datetime.date(2020, 3, 20), None),
 (14, 4, 2, None, None),
 (15, 4, 3, None, None),
 (16, 4, 4, None, None)]

In [14]:
%%sql
SELECT * FROM buy_archive;

 * mysql://root:***@localhost/mydb
10 rows affected.

[(1, 2, 1, 1, datetime.date(2019, 2, 21), Decimal('670.60'), 2),
 (2, 2, 1, 3, datetime.date(2019, 2, 21), Decimal('450.90'), 1),
 (3, 1, 2, 2, datetime.date(2019, 2, 10), Decimal('520.30'), 2),
 (4, 1, 2, 4, datetime.date(2019, 2, 10), Decimal('780.90'), 3),
 (5, 1, 2, 3, datetime.date(2019, 2, 10), Decimal('450.90'), 1),
 (6, 3, 4, 4, datetime.date(2019, 3, 5), Decimal('780.90'), 4),
 (7, 3, 4, 5, datetime.date(2019, 3, 5), Decimal('480.90'), 2),
 (8, 4, 1, 6, datetime.date(2019, 3, 12), Decimal('650.00'), 1),
 (9, 5, 2, 1, datetime.date(2019, 3, 18), Decimal('670.60'), 2),
 (10, 5, 2, 4, datetime.date(2019, 3, 18), Decimal('780.90'), 1)]

## 2.5.2 Задание

Включить нового человека в таблицу с клиентами. Его имя **Попов Илья**, его email **popov@test**, проживает он в **Москве**.

In [5]:
%%sql
INSERT INTO client (name_client, city_id, email)
SELECT 'Попов Илья', city_id, 'popov@test'
FROM city
WHERE name_city = 'Москва';

SELECT * FROM client;

 * mysql://root:***@localhost/mydb
1 rows affected.
5 rows affected.

[(1, 'Баранов Павел', 3, 'baranov@test'),
 (2, 'Абрамова Катя', 1, 'abramova@test'),
 (3, 'Семенонов Иван', 2, 'semenov@test'),
 (4, 'Яковлева Галина', 1, 'yakovleva@test'),
 (5, 'Попов Илья', 1, 'popov@test')]

## 2.5.3 Задание

Создать новый заказ для Попова Ильи. Его комментарий для заказа: «Связаться со мной по вопросу доставки».

In [6]:
%%sql
INSERT INTO buy(buy_description, client_id)
SELECT 'Связаться со мной по вопросу доставки', client_id
FROM client
WHERE name_client = 'Попов Илья';

SELECT * FROM buy;

 * mysql://root:***@localhost/mydb
1 rows affected.
5 rows affected.

[(1, 'Доставка только вечером', 1),
 (2, None, 3),
 (3, 'Упаковать каждую книгу по отдельности', 2),
 (4, None, 1),
 (5, 'Связаться со мной по вопросу доставки', 5)]

## 2.5.4 Задание

В таблицу **buy_book** добавить заказ с номером 5. Этот заказ должен содержать книгу Пастернака «Лирика» в количестве двух экземпляров и книгу Булгакова «Белая гвардия» в одном экземпляре.

In [7]:
%%sql
INSERT INTO buy_book(buy_id, book_id, amount)
SELECT 5, book_id, 2
FROM book INNER JOIN author USING (author_id)
WHERE title = 'Лирика' AND name_author = 'Пастернак Б.Л.'
UNION
SELECT 5, book_id, 1
FROM book INNER JOIN author USING (author_id)
WHERE title = 'Белая гвардия' AND name_author = 'Булгаков М.А.';

SELECT * FROM buy_book;

 * mysql://root:***@localhost/mydb
2 rows affected.
10 rows affected.

[(1, 1, 1, 1),
 (2, 1, 7, 2),
 (3, 1, 3, 1),
 (4, 2, 8, 2),
 (5, 3, 3, 2),
 (6, 3, 2, 1),
 (7, 3, 1, 1),
 (8, 4, 5, 1),
 (9, 5, 8, 2),
 (10, 5, 2, 1)]

## 2.5.5 Задание

Количество тех книг на складе, которые были включены в заказ с номером 5, уменьшить на то количество, которое в заказе с номером 5  указано.

In [8]:
%%sql
UPDATE
    book JOIN buy_book USING(book_id)
SET
    book.amount = book.amount - buy_book.amount
WHERE
    buy_book.buy_id = 5;

SELECT * FROM book;

 * mysql://root:***@localhost/mydb
2 rows affected.
8 rows affected.

[(1, 'Мастер и Маргарита', 1, 1, Decimal('670.99'), 3),
 (2, 'Белая гвардия', 1, 1, Decimal('540.50'), 4),
 (3, 'Идиот', 2, 1, Decimal('460.00'), 10),
 (4, 'Братья Карамазовы', 2, 1, Decimal('799.01'), 2),
 (5, 'Игрок', 2, 1, Decimal('480.50'), 10),
 (6, 'Стихотворения и поэмы', 3, 2, Decimal('650.00'), 15),
 (7, 'Черный человек', 3, 2, Decimal('570.20'), 6),
 (8, 'Лирика', 4, 2, Decimal('518.99'), 0)]

## 2.5.6 Задание

Создать счет (таблицу **buy_pay**) на оплату заказа с номером 5, в который включить название книг, их автора, цену, количество заказанных книг и  стоимость. Последний столбец назвать **Стоимость**. Информацию в таблицу занести в отсортированном по названиям книг виде.

In [9]:
%%sql
CREATE TABLE buy_pay AS
SELECT title, name_author, price, buy_book.amount, price * buy_book.amount AS Стоимость
FROM
    author
    JOIN book USING(author_id)
    JOIN buy_book USING(book_id)
WHERE
    buy_book.buy_id = 5
ORDER BY
    title;

SELECT * FROM buy_pay;

 * mysql://root:***@localhost/mydb
2 rows affected.
2 rows affected.

[('Белая гвардия', 'Булгаков М.А.', Decimal('540.50'), 1, Decimal('540.50')),
 ('Лирика', 'Пастернак Б.Л.', Decimal('518.99'), 2, Decimal('1037.98'))]

## 2.5.7 Задание

Создать общий счет (таблицу **buy_pay**) на оплату заказа с номером 5. Куда включить номер заказа, количество книг в заказе (название столбца **Количество**) и его общую стоимость (название столбца **Итого**). Для решения используйте ОДИН запрос.

In [12]:
%%sql
DROP TABLE IF EXISTS buy_pay;

CREATE TABLE buy_pay AS
SELECT
    buy_id,
    SUM(buy_book.amount) AS Количество,
    SUM(buy_book.amount * price) AS Итого
FROM
    book
    JOIN buy_book USING(book_id)
WHERE
    buy_id = 5;

SELECT * FROM buy_pay;

 * mysql://root:***@localhost/mydb
0 rows affected.
1 rows affected.
1 rows affected.

[(5, Decimal('3'), Decimal('1578.48'))]

## 2.5.8 Задание

В таблицу **buy_step** для заказа с номером 5 включить все этапы из таблицы **step**, которые должен пройти этот заказ. В столбцы **date_step_beg** и **date_step_end** всех записей занести Null.

In [13]:
%%sql
INSERT INTO buy_step(buy_id, step_id)
SELECT buy_id, step_id
FROM 
    buy, step
WHERE
    buy_id = 5;

SELECT * FROM buy_step;

 * mysql://root:***@localhost/mydb
4 rows affected.
20 rows affected.

[(1, 1, 1, datetime.date(2020, 2, 20), datetime.date(2020, 2, 20)),
 (2, 1, 2, datetime.date(2020, 2, 20), datetime.date(2020, 2, 21)),
 (3, 1, 3, datetime.date(2020, 2, 22), datetime.date(2020, 3, 7)),
 (4, 1, 4, datetime.date(2020, 3, 8), datetime.date(2020, 3, 8)),
 (5, 2, 1, datetime.date(2020, 2, 28), datetime.date(2020, 2, 28)),
 (6, 2, 2, datetime.date(2020, 2, 29), datetime.date(2020, 3, 1)),
 (7, 2, 3, datetime.date(2020, 3, 2), None),
 (8, 2, 4, None, None),
 (9, 3, 1, datetime.date(2020, 3, 5), datetime.date(2020, 3, 5)),
 (10, 3, 2, datetime.date(2020, 3, 5), datetime.date(2020, 3, 6)),
 (11, 3, 3, datetime.date(2020, 3, 6), datetime.date(2020, 3, 10)),
 (12, 3, 4, datetime.date(2020, 3, 11), None),
 (13, 4, 1, datetime.date(2020, 3, 20), None),
 (14, 4, 2, None, None),
 (15, 4, 3, None, None),
 (16, 4, 4, None, None),
 (17, 5, 1, None, None),
 (18, 5, 2, None, None),
 (19, 5, 3, None, None),
 (20, 5, 4, None, None)]

## 2.5.9 Задание

В таблицу **buy_step** занести дату 12.04.2020 выставления счета на оплату заказа с номером 5.

In [14]:
%%sql
UPDATE
    buy_step
    JOIN step USING(step_id)
SET
    date_step_beg = '2020.04.12'
WHERE
    buy_id = 5 AND
    name_step = 'Оплата';

SELECT * FROM buy_step WHERE buy_id = 5;

 * mysql://root:***@localhost/mydb
1 rows affected.
4 rows affected.

[(17, 5, 1, datetime.date(2020, 4, 12), None),
 (18, 5, 2, None, None),
 (19, 5, 3, None, None),
 (20, 5, 4, None, None)]

## 2.5.10 Задание

Завершить этап «**Оплата**» для заказа с номером 5, вставив в столбец **date_step_end** дату 13.04.2020, и начать следующий этап («**Упаковка**»), задав в столбце **date_step_beg** для этого этапа ту же дату.

Реализовать два запроса для завершения этапа и начала следующего. Они должны быть записаны в общем виде, чтобы его можно было применять для любых этапов, изменив только текущий этап. Для примера пусть это будет этап «**Оплата**».

In [15]:
%%sql
UPDATE
    buy_step 
    JOIN step USING(step_id)
SET
    date_step_end = '2020-04-13'
WHERE
    buy_id = 5 AND
    name_step ='Оплата';

UPDATE
    buy_step 
    JOIN step USING(step_id)
SET
    date_step_beg = '2020-04-13'
WHERE
    buy_id = 5 AND 
    buy_step.step_id = (
        SELECT step_id + 1
        FROM step
        WHERE name_step='Оплата');

SELECT * FROM buy_step WHERE buy_id = 5;

 * mysql://root:***@localhost/mydb
1 rows affected.
1 rows affected.
4 rows affected.

[(17, 5, 1, datetime.date(2020, 4, 12), datetime.date(2020, 4, 13)),
 (18, 5, 2, datetime.date(2020, 4, 13), None),
 (19, 5, 3, None, None),
 (20, 5, 4, None, None)]